#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <limits.h>

#define MAX 255 // максимальна розмірність масиву

int main(void)
{
	system("chcp 1251"); // таблиця кодування кирилиці

	char str[MAX]; //введена користувачем стрічка
	char zn[MAX]; // масив знаків
	double dg[MAX]; // масив чисел

	printf("\n\n  *=*=*=*=*КАЛЬКУЛЯТОР АРИФМЕТИЧНИХ ВИРАЗІВ*=*=*=*=*\n\n\n");

	printf("> Введіть арефметичний вираз (виконуються операції *,/,+,-)"
		"\nВикористовуйте . (крапку) для запису дробової чатини числа"
		"\nНе використовуйте дужок. Не ставте пробілів.\n\n");

	gets(str); // користувач вводить вираз

	// Перевірка виразу на правильність вводу
	for (char *p = str; *p != '\0'; p++) {
		if ((int)*p < '*' || (int)*p == ',' || (int)*p > '9') {
			printf("\n> Помилка вводу. У вашому виразі присутній невірний символ.\n"
				"Вводити дозволяється лише 10-ві цифри, крапку \'.\', і знаки операцій *,/,+,- \n Повторіть ввід!\n\n");
			rewind(stdin);
			gets(str);
			p = str;
			continue;
		}
		if (*p == '-' || *p == '+' || *p == '*' || *p == '/' || *p == '.') {
			p++;
			if (*p == '-' || *p == '+' || *p == '*' || *p == '/' || *p == '.') {
				printf("\n> Помилка вводу. Ви ввели кілька знаків операцій(або крапок) підряд. \nПовторіть ввід виразу!\n\n");
				rewind(stdin);
				gets(str);
				p = str;
				continue;
			}
			else p--;
		}
	}

	char *p = str; // вказівник на введений користувачем символьний рядок
	char *pzn = zn; // вказівник на символьний рядок зі знаками
	long double *pdg = dg; // вказівник на масив з числами

	long double answer = 0; // answer=змінна для результату операцій

	while (*p != '\0') {
		if (*p == '-') { // перевірка чи вираз не починається з мінуса
			*pdg = strtod(p, &p, 0); pdg++; // якщо так, то запишемо 1й операнд зі знаком '-'
		}

		// записуємо в масив з числами 2 операнда, а також знак між ними
		while (pdg != dg + 2 && *p != '\0') {

			if (*p == '-' || *p == '+' || *p == '*' || *p == '/') {
				*pzn = *p; p++; pzn++;
			}

			if (isdigit(*p)) {
				*pdg = strtod(p, &p, 0); pdg++;
			}
		}

		// перевіряємо наступний знак після 2 числа
		// якщо це множення, або ділення то записуємо знаки і числа в масиви
		// доки не зустрінеться операція з нижчим старшинством (тобто + або -)
		while (*p == '*' || *p == '/') {
			*pzn = *p; p++; pzn++;
			if (isdigit(*p)) {
				*pdg = strtod(p, &p, 0); pdg++;
			}
		}


		pzn--; pdg--;	// посуваємо вказівники вліво 
						// так щоб за ними були записані адр. знака і числа, що останніми записані в масиви
		// Виконуємо операції, допоки не залишиться 1 операнд
		while (pdg != dg) {
			switch (*pzn) {
			case '*':
				*(pdg - 1) = (*(pdg - 1)) * (*pdg);
				pdg--; pzn--;
				break;
			case '/':
				*(pdg - 1) = (*(pdg - 1)) / (*pdg);
				pdg--; pzn--;
				break;
			case '+':
				*(pdg - 1) = (*(pdg - 1)) + (*pdg);
				pdg--; pzn--;
				break;
			case '-':
				*(pdg - 1) = (*(pdg - 1)) - (*pdg);
				pdg--; pzn--;
				break;
			}
		}

		answer = answer + (*pdg); // знайдене значення додаємо до відповіді
		// і повертаємось на початок циклу, якщо в введеній стрічці ще є символи
	}

	printf("\n\n> РЕЗУЛЬТАТ:  %lf\n\n", answer);
	system("pause");
}